WenHao19961022/smartF/stm32_message_recever/include/message_recever_manager.h
#ifndef MESSAGE_RECEVER_MANAGER_H
#define MESSAGE_RECEVER_MANAGER_H

#include <mutex>
#include <atomic>
#include <string>
#include <vector>
#include "../api/stm32_message_recever_api.h"

// ==================== 常量 ====================
const bool kInitFinished = true;
const bool kInitUnfinished = false;

const uint8_t kFrameHead = 0xAA;
const uint8_t kFrameTail = 0x55;
const uint8_t kFrameMinLen = 10;

// ==================== 消息接收管理类 ====================
class MessageReceverManager {
public:
    static MessageReceverManager& GetInstance();

    void Init();
    bool IsReady() const { return mInitStatus.load(); }
    void MainLoop();
    FrigeratorHistoryInfo GetFrigeratorHistoryInfo();

private:
    MessageReceverManager();
    ~MessageReceverManager();

    MessageReceverManager(const MessageReceverManager&) = delete;
    MessageReceverManager& operator=(const MessageReceverManager&) = delete;

    bool InitSerial();
    bool ReadFromSerial(std::vector<uint8_t>& buffer);
    bool ParseSerialData(const std::vector<uint8_t>& data, FrigeratorInfoWithTimestamp& result);
    FrigeratorInfoWithTimestamp GetLatestFrigeratorInfo();
    void UpdateFrigeratorHistoryInfo(FrigeratorInfoWithTimestamp& newInfo);
    void SetReady() { mInitStatus.store(kInitFinished); }

    std::atomic<bool> mInitStatus{kInitUnfinished};
    std::mutex mDataMutex;
    FrigeratorHistoryInfo mHistoryInfo;

    std::string mSerialPort = "/dev/ttyTHS0";
    int mBaudrate = 115200;
    int mSerialFd = -1;

    // 变化阈值（从配置管理器读取）
    uint16_t mWeightChangeThreshold = 100;
    uint16_t mTemperatureChangeThreshold = 1;
    uint16_t mHumidityChangeThreshold = 5;
};

#endif // MESSAGE_RECEVER_MANAGER_H
